tap "baselime/tap"
tap "catppuccin/tap"
tap "edgedb/tap"
tap "homebrew/autoupdate"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/test-bot"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pnodet/nature", "git@github.com:pnodet/homebrew-nature.git"
tap "shopify/shopify"
tap "tursodatabase/tap"
brew "act"
brew "webp"
brew "openssl@3"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "ncurses"
brew "biome"
brew "coreutils"
brew "cask"
brew "gcc"
brew "ccache"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "libpq"
brew "php"
brew "composer"
brew "deno"
brew "direnv"
brew "dos2unix"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fastlane"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "graphviz"
brew "helm"
brew "htop"
brew "hurl"
brew "hyperfine"
brew "inetutils"
brew "infisical"
brew "irssi"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "nasm"
brew "neofetch"
brew "neonctl"
brew "neovim"
brew "ngrep"
brew "ninja"
brew "nmap"
brew "opam"
brew "openjdk@17"
brew "openjdk@21"
brew "or-tools"
brew "p7zip"
brew "pastel"
brew "php@8.1"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "postgresql@15"
brew "postgresql@16", link: true
brew "postgresql@17"
brew "prettier"
brew "pulumi"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "redis"
brew "rover"
brew "scw"
brew "sniffnet"
brew "solargraph"
brew "sshx"
brew "stockfish"
brew "swift-format"
brew "swiftformat"
brew "tailscale"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "tree"
brew "typescript"
brew "unzip"
brew "uv"
brew "vercel-cli"
brew "wget"
brew "yt-dlp"
brew "zig"
brew "zls"
brew "zoxide"
brew "zsh-completions"
brew "baselime/tap/baselime"
brew "catppuccin/tap/whiskers"
brew "edgedb/tap/edgedb-cli"
brew "oven-sh/bun/bun"
brew "pnodet/nature/nature"
brew "shopify/shopify/shopify-cli"
brew "tursodatabase/tap/turso"
cask "aerospace"
cask "airfoil"
cask "anaconda"
cask "android-commandlinetools"
cask "android-studio"
cask "beeper"
cask "bruno"
cask "calibre"
cask "cap"
cask "chatgpt"
cask "claude"
cask "colorpicker-propicker"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "expo-orbit"
cask "figma"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "granola"
cask "lens"
cask "linear-linear"
cask "little-snitch"
cask "macfuse"
cask "messenger"
cask "notion"
cask "notion-mail"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "overlayed"
cask "pika"
cask "postman"
cask "purevpn"
cask "raycast"
cask "screen-studio"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "superwhisper"
cask "swiftformat-for-xcode"
cask "tableplus"
cask "telegram-desktop"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp@beta"
cask "whisky"
cask "yacreader"
cask "zed"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "ahmadalli.vscode-nginx-conf"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "austenc.tailwind-docs"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chenglou92.rescript-vscode"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drcika.apc-extension"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "foxundermoon.shell-format"
vscode "frenco.vscode-vercel"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "million.million-lint"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "ocamllabs.ocaml-platform"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qiaojie.binary-viewer"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.polaris-for-vscode"
vscode "sissel.shopify-liquid"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "ziglang.vscode-zig"
