tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "ldez/tap"
brew "openssl@1.1"
brew "bash"
brew "bat"
brew "bench"
brew "binutils"
brew "bison"
brew "brew-cask-completion"
brew "colordiff"
brew "composer"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "dos2unix"
brew "ed"
brew "guile"
brew "p11-kit"
brew "emacs"
brew "exa"
brew "harfbuzz"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gh"
brew "gist"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gpatch"
brew "grc"
brew "grep"
brew "gzip"
brew "htop"
brew "hugo"
brew "jq"
brew "less"
brew "libressl"
brew "m-cli"
brew "m4"
brew "macosvpn"
brew "make"
brew "mas"
brew "minisign"
brew "moreutils"
brew "mtr"
brew "nano"
brew "navi"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openssh"
brew "perl"
brew "php"
brew "rsync"
brew "ruby"
brew "screen"
brew "screenfetch"
brew "subversion"
brew "syncthing"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "wifi-password"
brew "youtube-dl"
cask "apparency"
cask "discord"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iina"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "rocket"
cask "signal"
cask "skype"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Spark", id: 1176895641
mas "Stockfish", id: 801463932
mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
