# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Databases & SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox-developer-edition"
# Desktop client for GitHub repositories
cask "github"
# Desktop client GPG Keys
cask "gpg-suite"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "purevpn"
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Web browser focusing on security
cask "tor-browser"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Torrent streaming application
cask "webtorrent"

mas "AdGuard for Safari", id: 1440147259
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
