tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "ldez/tap"
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
brew "bench"
brew "binutils"
brew "bison"
brew "brew-cask-completion"
brew "colordiff"
# A Dependency Manager for PHP
brew "composer"
brew "coreutils"
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
brew "docker"
brew "docker-compose", link: false
brew "docker-machine"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
brew "ed"
brew "guile"
brew "p11-kit"
brew "emacs"
# ls but better
brew "exa"
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flex"
# Command-line fuzzy finder written in Go
brew "fzf"
brew "gawk"
brew "gdb"
brew "gh"
# Potentially the best command line gister.
brew "gist"
brew "git"
# An open source Git extension for versioning large files
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gpatch"
# Colorize logfiles and command output
brew "grc"
brew "grep"
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
brew "less"
brew "libressl"
# Swiss Army Knife for macOS
brew "m-cli"
brew "m4"
# Create Mac OS VPNs programmatically
brew "macosvpn"
brew "make"
# Mac App Store command-line interface
brew "mas"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
brew "nano"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Generate ASCII art with terminal, shell, and OS info
brew "neofetch"
brew "navi"
# Vim but better
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
brew "openssh"
brew "perl"
brew "php"
brew "rsync"
brew "ruby"
brew "screen"
brew "subversion"
brew "syncthing"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Download YouTube videos from the command-line
brew "youtube-dl"